{
  "users": [
    {
      "id": 1,
      "fullName": "Michael Wright",
      "dateCreated": 1630601178083,
      "email": "mike@nss.pizza"
    },
    {
      "fullName": "Guest",
      "dateCreated": 1630601178083,
      "email": "no-reply@nss.pizza",
      "id": 2
    }
  ],
  "moods": [
    {
      "id": 1,
      "moodName": "Awesome",
      "moodImage": "mood-nailed-it-icon.png"
    },
    {
      "moodName": "Good",
      "moodImage": "mood-good-icon.png",
      "id": 2
    },
    {
      "moodName": "Meeeh",
      "moodImage": "mood-meeeh-icon.png",
      "id": 3
    },
    {
      "moodName": "Terrible",
      "moodImage": "mood-bad-icon.png",
      "id": 4
    }
  ],
  "entries": [
    {
      "id": 1,
      "userId": 1,
      "dateCreated": 1630601178083,
      "dateModified": 1630601178083,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "",
      "message": ""
    },
    {
      "userId": 1,
      "dateCreated": 1630618339352,
      "dateModified": 1630618339352,
      "modifiedBy": 1,
      "moodId": 2,
      "subject": "GiffyGram: Application Data, Connect HTML & JS",
      "message": "We got into APIs more today. Also, we learned about two more fancy ways to declare functions. I like the that there's a easy way to declare a single line function that does or doesn't pass an argument. \n I think that slash-n I just typed might drop to the next line. Probably won't though. We'll see what happens. The only reason I'm not feeling Awesome today and am only feeling Good is because I want to know how to automated the dateCreated values (or all date values really). We didn't cover that, so I might do some investigating on my own. Maybe -- but not before I catch up my Daily Journal the chapters.",
      "id": 2
    },
    {
      "userId": 1,
      "dateCreated": 1631115891937,
      "dateModified": 1631115891937,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "Random User exercise",
      "message": "I feel like this was one of the exercises I've been waiting for. Up until now, we've been access lists of items and displaying them as lists. I've been looking forward to display only one item at a time because I have a personal project I want to build. For the last 2-3 years, I've been listing facts about myself in an Google Doc with the intent to use them on my website About page. \nThe idea is that a site visitor can click a button that displays a random fact about me from the list. Now, I know how to pull it off – in the DOM at least.",
      "id": 3
    },
    {
      "userId": 1,
      "dateCreated": 1631159915184,
      "dateModified": 1631159915184,
      "modifiedBy": 1,
      "moodId": 2,
      "subject": "Creating the form that posts a post for GiffyGram",
      "message": "I definitely spent too much time on the forms and html in general. I meant to go a few more hours after class to get my journal entry list displaying. I didn't even get to the JS lol. Wow. I doing a lot HTML and alot of CSS for the new entry form and the entry list cards. I feel confident that I can take the code from giffygram and modify it to work for the journal, but still, I didn't touch it tonight. This day was good but not awesome.",
      "id": 4
    },
    {
      "userId": 1,
      "dateCreated": 1631490374658,
      "dateModified": 1631490374658,
      "modifiedBy": 1,
      "moodId": 3,
      "subject": "A little Journal Work on a Sunday",
      "message": "When I left off Friday, I was stuck on getting my new journal entry form to work. The date and the mood selectors stop being clickable. I have no idea what's wrong. I think I'm going to play around with the event listener. Maybe they're not all supposed to start with 'applicationElement'. I don't know. We'll see what happens. Since yesterday, I've been going back through the chapters on Event Listeners.\n My mood isn't good. I really wanted more time on the individual stuff before we got into another group project. I still don't have full functionality of Giffygram. It is what it is, but I'm confused about when to get help on Giffygram and Daily Journal. I'll ask and find out.",
      "id": 5
    },
    {
      "userId": 1,
      "dateCreated": 1631492972249,
      "dateModified": 1631492972249,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "My form buttons work when Main module turned off",
      "message": "I commented out my main js script line in the index.html, and boom my datepicker and mood selector is working again. Something is broken in main.js OR something in there is causing my datepicker and mood radio buttons to not work. I suspect something in the event listener. I think I'll comment out one function at a time until I figure it out. Unfortunately, I'm not getting an error in the inspector to help narrow it down.",
      "id": 6
    },
    {
      "userId": 1,
      "dateCreated": 1631654219609,
      "dateModified": 1631654219609,
      "modifiedBy": 1,
      "moodId": 3,
      "subject": "Holiday Road, take me home to a place I belong",
      "message": "Today was, as Russians say in American-made movies, sh*t. Poor Bryan really put in time with us to get the dropdowns and preview section working. We still have one person's module to sort out tomorrow morning. The Holiday Road project introduced more concepts than I was and my teammates could figure out how to do. We got the modules for template littorals to work well enough. We just had to get help with getting them to spit out what we needed. This project felt like a very huge leap from giffy gram. On paper, it seemed easy enough, and of course the styling and layout are the most simple pieces. At the end of the day, I feel like crap mentally, and I don't want to look at VS Code for a few hours. That's unfortunate because I'm still using Postman to submit my journal entries. I want to be clear: I feel very accomplished. The team and I agreed that today felt way too difficult. With that, my mood is right in the middle of good and terrible -- meeeh. To go out on a slightly positive note, what we learned today will help me sort out where I'm stuck in my journal. That's worth two ethnic thumbs up!👍🏾👍🏾.",
      "id": 7
    },
    {
      "userId": 1,
      "dateCreated": 1632166945712,
      "moodId": "",
      "subject": "test with year 0011",
      "dateModified": 1632166945712,
      "modifiedBy": 1,
      "id": 8
    },
    {
      "userId": 1,
      "dateCreated": 1632167014653,
      "moodId": "",
      "subject": "test with year 0011",
      "dateModified": 1632167014653,
      "modifiedBy": 1,
      "id": 9
    },
    {
      "userId": 1,
      "dateCreated": 1632167015897,
      "moodId": "",
      "subject": "test with year 0011",
      "dateModified": 1632167015897,
      "modifiedBy": 1,
      "id": 10
    },
    {
      "userId": 1,
      "dateCreated": 1632167056912,
      "moodId": "",
      "subject": "",
      "dateModified": 1632167056912,
      "modifiedBy": 1,
      "id": 11
    },
    {
      "userId": 1,
      "dateCreated": 1632167066314,
      "moodId": "",
      "subject": "",
      "dateModified": 1632167066314,
      "modifiedBy": 1,
      "id": 12
    },
    {
      "userId": 1,
      "dateCreated": 1632167181495,
      "moodId": "",
      "subject": "",
      "dateModified": 1632167181495,
      "modifiedBy": 1,
      "id": 13
    },
    {
      "userId": 1,
      "dateCreated": 1632167282133,
      "moodId": "",
      "subject": "test line",
      "dateModified": 1632167282133,
      "modifiedBy": 1,
      "id": 14
    },
    {
      "userId": 1,
      "dateCreated": 1632167748393,
      "moodId": "",
      "subject": "Subject works because it's an input\nsubject works becuase it's an input",
      "message": "fbghjhktrgefwds NOTHR TST FOR MESSAGE CONTENT",
      "dateModified": 1632167748393,
      "modifiedBy": 1,
      "id": 15
    },
    {
      "authorId": 1,
      "dateCreated": 1632503388701,
      "moodId": "awesome",
      "subject": "test",
      "message": "sgdhfjgbhnm,",
      "dateModified": 1632503388701,
      "modifiedBy": 1,
      "id": 16
    },
    {
      "userId": 1,
      "dateCreated": 1632504009424,
      "moodId": 3,
      "subject": "Test of Mood giving ID as an integer",
      "message": "Test of Mood giving ID as an integer Test of Mood giving ID as an integerTest of Mood giving ID as an integerTest of Mood giving ID as an integerTest of Mood giving ID as an integerTest of Mood giving ID as an integerTest of Mood giving ID as an integer",
      "dateModified": 1632504009424,
      "modifiedBy": 1,
      "id": 17
    },
    {
      "userId": 1,
      "dateCreated": 1632504318499,
      "moodId": 1,
      "subject": "I think I got my journal posting from the web page",
      "message": "This might be it. Everything is wired up. I might be done posting my journal entries from Postman - finally! The moods selection was holding me back as well as the date time. This is starting to feel like a commit message.",
      "dateModified": 1632504318499,
      "modifiedBy": 1,
      "id": 18
    },
    {
      "userId": 1,
      "dateCreated": 1632617375901,
      "moodId": 2,
      "subject": "Geeking out about learning React after checking out Material UI",
      "message": "Today, I checked out a couple videos on for extensions and settings in VS Code. Then, I decided to refer to some notes I made from C49's Demo Day. I was curious about the UI design frameworks mentioned by a handful of the students, and I went down a rabbit hole. CSS frameworks I've been curious about were Tailwind and Bulma CSS -- the latter was used by a C49 student in their program. A couple of things didn't sit well with me about the CSS libraries: neither are using logical properties for significant sizing properties like margin, padding, and border. For example, the frameworks might use class names like \"ml\" for margin-left or \"mx\" for both margin-left and margin-right. But there is not logical property classes that would say something like \"mis\" for margin-inline-start or \"mi\" for margin-inline. That bugs me and makes them feel dated. One cool thing I liked about Tailwind is that there is a feature where you can \"turn-off\" the margin features, so the margin classes won't be recognized if they're written into your HTML.\nAfter that, I started checking out Material UI (MUI) -- a UI library for react and its components. I could be using those terms incorrectly. We literally talked about React for the first time Friday. Anyway, I'm gonna like using Material UI. Probably the coolest part is that MUI has an Adobe XD plugin. I f**kin love Adobe XD so much. If a job exists where I could do my entire workflow inside the application, I would consider going back to the workforce full-time -- no BS.",
      "dateModified": 1632617375901,
      "modifiedBy": 1,
      "id": 19
    },
    {
      "userId": 1,
      "dateCreated": 1632617625875,
      "moodId": 3,
      "subject": "testing the line break",
      "message": "egrBWSR2Fgbtw32few&#13;&#10; Testing the line break",
      "dateModified": 1632617625875,
      "modifiedBy": 1,
      "id": 20
    }
  ]
}