{
  "users": [
    {
      "id": 1,
      "fullName": "Michael Wright",
      "dateCreated": 1630601178083,
      "email": "mike@nss.pizza"
    },
    {
      "fullName": "Guest",
      "dateCreated": 1630601178083,
      "email": "no-reply@nss.pizza",
      "id": 2
    }
  ],
  "moods": [
    {
      "id": 1,
      "moodName": "Awesome",
      "moodImage": "mood-nailed-it-icon.png"
    },
    {
      "moodName": "Good",
      "moodImage": "mood-good-icon.png",
      "id": 2
    },
    {
      "moodName": "Meeeh",
      "moodImage": "mood-meeeh-icon.png",
      "id": 3
    },
    {
      "moodName": "Terrible",
      "moodImage": "mood-bad-icon.png",
      "id": 4
    }
  ],
  "entries": [
    {
      "id": 1,
      "authorId": 1,
      "dateCreated": 1630601178083,
      "dateModified": 1630601178083,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "",
      "message": ""
    },
    {
      "authorId": 1,
      "dateCreated": 1630618339352,
      "dateModified": 1630618339352,
      "modifiedBy": 1,
      "moodId": 2,
      "subject": "GiffyGram: Application Data, Connect HTML & JS",
      "message": "We got into APIs more today. Also, we learned about two more fancy ways to declare functions. I like the that there's a easy way to declare a single line function that does or doesn't pass an argument. \n I think that slash-n I just typed might drop to the next line. Probably won't though. We'll see what happens. The only reason I'm not feeling Awesome today and am only feeling Good is because I want to know how to automated the dateCreated values (or all date values really). We didn't cover that, so I might do some investigating on my own. Maybe -- but not before I catch up my Daily Journal the chapters.",
      "id": 2
    },
    {
      "authorId": 1,
      "dateCreated": 1631115891937,
      "dateModified": 1631115891937,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "Random User exercise",
      "message": "I feel like this was one of the exercises I've been waiting for. Up until now, we've been access lists of items and displaying them as lists. I've been looking forward to display only one item at a time because I have a personal project I want to build. For the last 2-3 years, I've been listing facts about myself in an Google Doc with the intent to use them on my website About page. \nThe idea is that a site visitor can click a button that displays a random fact about me from the list. Now, I know how to pull it off – in the DOM at least.",
      "id": 3
    },
    {
      "authorId": 1,
      "dateCreated": 1631159915184,
      "dateModified": 1631159915184,
      "modifiedBy": 1,
      "moodId": 2,
      "subject": "Creating the form that posts a post for GiffyGram",
      "message": "I definitely spent too much time on the forms and html in general. I meant to go a few more hours after class to get my journal entry list displaying. I didn't even get to the JS lol. Wow. I doing a lot HTML and alot of CSS for the new entry form and the entry list cards. I feel confident that I can take the code from giffygram and modify it to work for the journal, but still, I didn't touch it tonight. This day was good but not awesome.",
      "id": 4
    },
    {
      "authorId": 1,
      "dateCreated": 1631490374658,
      "dateModified": 1631490374658,
      "modifiedBy": 1,
      "moodId": 3,
      "subject": "A little Journal Work on a Sunday",
      "message": "When I left off Friday, I was stuck on getting my new journal entry form to work. The date and the mood selectors stop being clickable. I have no idea what's wrong. I think I'm going to play around with the event listener. Maybe they're not all supposed to start with 'applicationElement'. I don't know. We'll see what happens. Since yesterday, I've been going back through the chapters on Event Listeners.\n My mood isn't good. I really wanted more time on the individual stuff before we got into another group project. I still don't have full functionality of Giffygram. It is what it is, but I'm confused about when to get help on Giffygram and Daily Journal. I'll ask and find out.",
      "id": 5
    },
    {
      "authorId": 1,
      "dateCreated": 1631492972249,
      "dateModified": 1631492972249,
      "modifiedBy": 1,
      "moodId": 1,
      "subject": "My form buttons work when Main module turned off",
      "message": "I commented out my main js script line in the index.html, and boom my datepicker and mood selector is working again. Something is broken in main.js OR something in there is causing my datepicker and mood radio buttons to not work. I suspect something in the event listener. I think I'll comment out one function at a time until I figure it out. Unfortunately, I'm not getting an error in the inspector to help narrow it down.",
      "id": 6
    }
  ]
}